{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "(": 4,
      ")": 5,
      ".": 6,
      ";": 7,
      "VAR_1": 8,
      "{": 9,
      "}": 10,
      ",": 11,
      "VAR_2": 12,
      "=": 13,
      "java": 14,
      "VAR_3": 15,
      "TYPE_1": 16,
      "METHOD_1": 17,
      "METHOD_2": 18,
      "lang": 19,
      "VAR_4": 20,
      "METHOD_3": 21,
      "if": 22,
      "TYPE_2": 23,
      "public": 24,
      "return": 25,
      "new": 26,
      "VAR_5": 27,
      "METHOD_4": 28,
      "String": 29,
      "void": 30,
      "<": 31,
      "null": 32,
      "int": 33,
      ">": 34,
      "TYPE_3": 35,
      "STRING_1": 36,
      "METHOD_5": 37,
      "0": 38,
      "+": 39,
      "VAR_6": 40,
      "this": 41,
      "i": 42,
      "[": 43,
      "]": 44,
      "util": 45,
      "==": 46,
      "METHOD_6": 47,
      "STRING_2": 48,
      ":": 49,
      "TYPE_4": 50,
      "1": 51,
      "!=": 52,
      "private": 53,
      "else": 54,
      "VAR_7": 55,
      "true": 56,
      "for": 57,
      "false": 58,
      "INT_1": 59,
      "final": 60,
      "get": 61,
      "boolean": 62,
      "METHOD_7": 63,
      "-": 64,
      "io": 65,
      "throws": 66,
      "static": 67,
      "try": 68,
      "catch": 69,
      "STRING_3": 70,
      "!": 71,
      "&&": 72,
      "++": 73,
      "out": 74,
      "List": 75,
      "add": 76,
      "TYPE_5": 77,
      "android": 78,
      "VAR_8": 79,
      "result": 80,
      "size": 81,
      "System": 82,
      "length": 83,
      "println": 84,
      "view": 85,
      "equals": 86,
      "Exception": 87,
      "case": 88,
      "toString": 89,
      "METHOD_8": 90,
      "ArrayList": 91,
      "class": 92,
      "content": 93,
      "id": 94,
      "name": 95,
      "protected": 96,
      "IOException": 97,
      "x": 98,
      "Integer": 99,
      "double": 100,
      "STRING_4": 101,
      "throw": 102,
      "Object": 103,
      "value": 104,
      "||": 105,
      "super": 106,
      "break": 107,
      "?": 108,
      "put": 109,
      "context": 110,
      "INT_2": 111,
      "VAR_9": 112,
      "data": 113,
      "position": 114,
      "long": 115,
      "index": 116,
      "*": 117,
      "Intent": 118,
      "intent": 119,
      "TYPE_6": 120,
      "key": 121,
      "y": 122,
      "while": 123,
      "item": 124,
      "View": 125,
      "c": 126,
      "File": 127,
      "event": 128,
      "setText": 129,
      "response": 130,
      "\"": 131,
      "/": 132,
      "assertEquals": 133,
      "getName": 134,
      "p": 135,
      "METHOD_9": 136,
      "+=": 137,
      "args": 138,
      "j": 139,
      "list": 140,
      "message": 141,
      "remove": 142,
      "n": 143,
      "start": 144,
      "node": 145,
      "isEmpty": 146,
      "type": 147,
      "getString": 148,
      "STRING_5": 149,
      "file": 150,
      "Map": 151,
      "getId": 152,
      "append": 153,
      "instanceof": 154,
      ">=": 155,
      "float": 156,
      "path": 157,
      "a": 158,
      "VAR_10": 159,
      "info": 160,
      "byte": 161,
      "t": 162,
      "values": 163,
      "getText": 164,
      "error": 165,
      "switch": 166,
      "count": 167,
      "contains": 168,
      "b": 169,
      "<=": 170,
      "show": 171,
      "INT_3": 172,
      "query": 173,
      "set": 174,
      "getValue": 175,
      "synchronized": 176,
      "getActivity": 177,
      "msg": 178,
      "url": 179,
      "format": 180,
      "obj": 181,
      "TYPE_7": 182,
      "Long": 183,
      "state": 184,
      "execute": 185,
      "text": 186,
      "build": 187,
      "FLOAT_1": 188,
      "STRING_6": 189,
      "update": 190,
      "METHOD_10": 191,
      "Date": 192,
      "Set": 193,
      "StringBuilder": 194,
      "status": 195,
      "temp": 196,
      "line": 197,
      "getClass": 198,
      "HashMap": 199,
      "params": 200,
      "main": 201,
      "VAR_11": 202,
      "array": 203,
      "output": 204,
      "--": 205,
      "getContext": 206,
      "Class": 207,
      "f": 208,
      "Thread": 209,
      "buffer": 210,
      "str": 211,
      "substring": 212,
      "target": 213,
      "Double": 214,
      "default": 215,
      "iterator": 216,
      "init": 217,
      "assertTrue": 218,
      "date": 219,
      "finally": 220,
      "source": 221,
      "parseInt": 222,
      "end": 223,
      "CHAR_1": 224,
      "split": 225,
      "height": 226,
      "title": 227,
      "Context": 228,
      "offset": 229,
      "element": 230,
      "|": 231,
      "commit": 232,
      "time": 233,
      "INT_4": 234,
      "char": 235,
      "Math": 236,
      "%": 237,
      "setEnabled": 238,
      "Boolean": 239,
      "token": 240,
      "k": 241,
      "listener": 242,
      "fileName": 243,
      "replace": 244,
      "min": 245,
      "STRING_7": 246,
      "delete": 247,
      "assertThat": 248,
      "field": 249,
      "trim": 250,
      "writer": 251,
      "Throwable": 252,
      "getType": 253,
      "...": 254,
      "extends": 255,
      "toLowerCase": 256,
      "\"\\": 257,
      "sum": 258,
      "VAR_12": 259,
      "Collection": 260,
      "number": 261,
      "num": 262,
      "first": 263,
      "getInt": 264,
      "Calendar": 265,
      "METHOD_11": 266,
      "TYPE_8": 267,
      "HashSet": 268,
      "results": 269,
      "&": 270,
      "getTime": 271,
      "print": 272,
      "method": 273,
      "compareTo": 274,
      "Arrays": 275,
      "asList": 276,
      "0F": 277,
      "assert": 278,
      "setValue": 279,
      "string": 280,
      "Scanner": 281,
      "assertNotNull": 282,
      "tmp": 283,
      "Random": 284,
      "filename": 285,
      "label": 286,
      "INT_5": 287,
      "parameters": 288,
      "InputStream": 289,
      "STRING_8": 290,
      "Iterator": 291,
      "Entry": 292,
      "err": 293,
      "getData": 294,
      "LinkedList": 295,
      "counter": 296,
      "Void": 297,
      "handle": 298,
      "-=": 299,
      "to": 300,
      "BufferedReader": 301,
      "getBoolean": 302,
      "getIntent": 303,
      "widget": 304,
      "VAR_13": 305,
      "fail": 306,
      "open": 307,
      "buf": 308,
      "startsWith": 309,
      "NullPointerException": 310,
      "URL": 311,
      "net": 312,
      "filePath": 313,
      "FLOAT_2": 314,
      "abs": 315,
      "className": 316,
      "replaceAll": 317,
      "keys": 318,
      "getView": 319,
      "CHAR_2": 320,
      "param": 321,
      "continue": 322,
      "arg": 323,
      "startTime": 324,
      "names": 325,
      "FileInputStream": 326,
      "STRING_9": 327,
      "INT_6": 328,
      "src": 329,
      "getInstance": 330,
      "answer": 331,
      "FileOutputStream": 332,
      "METHOD_12": 333,
      "StringBuffer": 334,
      "pattern": 335,
      "getColor": 336,
      "Properties": 337,
      "Button": 338,
      "select": 339,
      "ClassNotFoundException": 340,
      "intValue": 341,
      "TYPE_9": 342,
      "short": 343,
      "CharSequence": 344,
      "expr": 345,
      "op": 346,
      "exit": 347,
      "step": 348,
      "VAR_14": 349,
      "nodes": 350,
      "toUpperCase": 351,
      "do": 352,
      "words": 353,
      "errors": 354,
      "Float": 355,
      "rows": 356,
      "getConfig": 357,
      "FileWriter": 358,
      "STRING_10": 359,
      "pow": 360,
      "1L": 361,
      "setState": 362,
      "0L": 363,
      "diff": 364,
      "write": 365,
      "var": 366,
      "BufferedWriter": 367,
      "operation": 368,
      "random": 369,
      "awt": 370,
      "FileReader": 371,
      "INT_7": 372,
      "VAR_15": 373,
      "Collections": 374,
      "sort": 375,
      "*=": 376,
      "fieldName": 377,
      "Assert": 378,
      "org": 379,
      "testng": 380,
      "STRING_11": 381,
      "parseLong": 382,
      "attribute": 383,
      "Matcher": 384,
      "regex": 385,
      "Logger": 386,
      "getLogger": 387,
      "logging": 388,
      "round": 389,
      "Vector": 390,
      "FLOAT_3": 391,
      "endTime": 392,
      "LinearLayout": 393,
      "Color": 394,
      "function": 395,
      "|=": 396,
      "STRING_12": 397,
      "METHOD_13": 398,
      "INT_8": 399,
      "getSelection": 400,
      "VAR_16": 401,
      "TYPE_10": 402,
      "/=": 403,
      "CHAR_3": 404,
      "FLOAT_4": 405,
      "addComponent": 406,
      "VAR_17": 407,
      "&=": 408,
      "STRING_13": 409,
      "INT_9": 410,
      "VAR_18": 411,
      "CHAR_4": 412,
      "METHOD_14": 413,
      "^": 414,
      "~": 415,
      "STRING_14": 416,
      "stringBuilder": 417,
      "Font": 418,
      "VAR_19": 419,
      "STRING_15": 420,
      "TYPE_11": 421,
      "NULL": 422,
      "not": 423,
      "VAR_20": 424,
      "INT_10": 425,
      "VAR_21": 426,
      "FLOAT_5": 427,
      "STRING_16": 428,
      "CHAR_5": 429,
      "INT_11": 430,
      "STRING_17": 431,
      "VAR_22": 432,
      "VAR_23": 433,
      "<<=": 434,
      "METHOD_15": 435,
      "CHAR_6": 436,
      "STRING_18": 437,
      "VAR_24": 438,
      "^=": 439,
      "%=": 440,
      "INT_13": 441,
      "VAR_25": 442,
      "INT_12": 443,
      "METHOD_16": 444,
      "STRING_19": 445,
      "FLOAT_6": 446,
      "INT_14": 447,
      "TYPE_12": 448,
      "METHOD_17": 449,
      "CHAR_7": 450,
      "STRING_20": 451,
      "VAR_26": 452,
      "VAR_27": 453,
      "STRING_21": 454,
      ">>=": 455,
      "FLOAT_7": 456,
      "TYPE_13": 457,
      "CHAR_8": 458,
      "FLOAT_8": 459,
      "FLOAT_9": 460,
      "INT_15": 461,
      "STRING_22": 462,
      "STRING_23": 463,
      "VAR_28": 464,
      "VAR_29": 465,
      "CHAR_10": 466,
      "implements": 467,
      ">>>=": 468,
      "CHAR_9": 469,
      "FLOAT_10": 470,
      "FLOAT_11": 471,
      "INT_16": 472,
      "STRING_24": 473,
      "STRING_25": 474,
      "STRING_26": 475,
      "TYPE_14": 476,
      "native": 477,
      "METHOD_18": 478,
      "STRING_27": 479,
      "TYPE_16": 480,
      "TYPE_17": 481,
      "TYPE_18": 482,
      "VAR_30": 483,
      "VAR_31": 484,
      "VAR_32": 485,
      "VAR_33": 486,
      "VAR_34": 487,
      "VAR_35": 488,
      "VAR_36": 489,
      "VAR_37": 490,
      "VAR_38": 491,
      "VAR_39": 492,
      "STRING_28": 493,
      "TYPE_15": 494
    },
    "unk_token": "[UNK]"
  }
}
